/* 4 0 이 출력되게 만드세요 */
#include <stdio.h>

int main()
{
	unsigned char flag1 = 1 << 7; // 2^7 = 128  => 1000 0000
	unsigned char flag2 = 1 << 3; // 2^3 = 8    => 0000 1000

  flag1 |= 1 << 2; // 1<<2 => 0000 0100 to flag1 =>  1000 0100
	flag1 &= ~(1 << 7); // 1<< 7=> 1000 0000 to ~flag1 =>  
	flag2 ^= 1 << 3;    // 1<<3 => 0000 1000
	/* flag1 = 0000 0100  */
	/* flag2 = 0000 0000 */

	printf("%u %u\n", flag1, flag2); // 0000 0100 , 0000 0000
 
  return 0;
}

/* 0111 1111
	 1000 0100
	 0000 0100
 */